ednieuw/ESP32Communications/Old/ESP32Arduino_CommV029/ESP32Arduino_CommV029.ino
    case 'K':  
      snprintf(sptext, sizeof(sptext), "K Test LDR, Print timestamp. K0=Off, K1=per min, K2 is per hour");
      if (len == 1)
        {                                                                                     // Test LDR
         TestLDR = 1 - TestLDR;
         snprintf(sptext, sizeof(sptext), "TestLDR: %s", TestLDR ? "On\n   Bits, Out, loops per second and time" : "Off\n");
        }
       if(InputString.equalsIgnoreCase("K0"))                                                 // do not log
        {
         Mem.TimeLogPrint = 0;
         snprintf(sptext, sizeof(sptext), "Time display per minute and hour is: %s", Mem.TimeLogPrint ? "ON\n" : "OFF\n");  
        } 
       if(InputString.equalsIgnoreCase("K1"))                                                 // Log per minute
        {
         Mem.TimeLogPrint = 1;
         snprintf(sptext, sizeof(sptext), "Time display per minute is: %s", Mem.TimeLogPrint ? "ON\n" : "OFF\n");  
        } 
       if(InputString.equalsIgnoreCase("K2"))                                                 // Log per hour
        {
         Mem.TimeLogPrint = 2;
         snprintf(sptext, sizeof(sptext), "Time display per hour is: %s", Mem.TimeLogPrint ? "ON\n" : "OFF\n");  
        }       
      break;

    case 'L':                                                                                 // Lower brightness
      if(len > 1 && len < 5) 
       {
        Mem.LowerBrightness = (byte)SConstrainInt(InputString, 1, 0, 250);
        snprintf(sptext, sizeof(sptext), "Lower brightness: %d bits", Mem.LowerBrightness);
       } 
      else snprintf(sptext, sizeof(sptext), "**** Input fault. \nEnter Lnnn where n between 1 and 250");
      break;
      
    case 'M':                                                                                 // Max brightness
      if(len > 1 && len < 5) 
       {
        Mem.UpperBrightness = SConstrainInt(InputString, 1, 1, 255);
        snprintf(sptext, sizeof(sptext), "Upper brightness changed to: %d bits", Mem.UpperBrightness);
       } 
      else snprintf(sptext, sizeof(sptext), "**** Input fault. \nEnter Mnnn where n between 1 and 255");
      break;
      
    case 'N':                                                                                 // Turn off display between hours
      snprintf(sptext, sizeof(sptext), "**** Length fault N. ****");
      if(len == 1) { Mem.TurnOffLEDsAtHH = Mem.TurnOnLEDsAtHH = 0;  } 
      else if(len == 5) 
       {
        Mem.TurnOffLEDsAtHH = (byte)InputString.substring(1, 3).toInt();
        Mem.TurnOnLEDsAtHH  = (byte)InputString.substring(3, 5).toInt();
       }
      Mem.TurnOffLEDsAtHH = _min(Mem.TurnOffLEDsAtHH, 23);
      Mem.TurnOnLEDsAtHH  = _min(Mem.TurnOnLEDsAtHH, 23);
      snprintf(sptext, sizeof(sptext), "Display is OFF between %2d:00 and %2d:00", Mem.TurnOffLEDsAtHH, Mem.TurnOnLEDsAtHH);
      break;
      
    case 'O':                                                                                 // Turn On/Off Display
      if(len == 1) 
       {
        LEDsAreOff = !LEDsAreOff;
        snprintf(sptext, sizeof(sptext), "Display is %s", LEDsAreOff ? "OFF" : "ON");
        if(LEDsAreOff) { ClearScreen(); }
        else 
         {
          Tekstprintln(sptext);
          lastminute = 99;                                                                    // Force display update
          sptext[0]=0;                                                                        // Suppress a second print of sptext
         }
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault O. ****");
      break;
      
    case 'P':                                                                                 // Status LEDs On/Off
      if(len == 1) 
        {
         Mem.StatusLEDOn = !Mem.StatusLEDOn;
         UpdateStatusLEDs(0);
         snprintf(sptext, sizeof(sptext), "StatusLEDs are %s", Mem.StatusLEDOn ? "ON" : "OFF");
        } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault P. ****");
      break;

    case 'Q':                                                                                 // *** Empty *** 
      if(len == 1) 
        {
         Mem.TimeSender = 1 - Mem.TimeSender;
         if (Mem.TimeSender)  Mem.TimeReceiver = 0;                                           // turn off TimeReceiver                                                                                                    
         snprintf(sptext, sizeof(sptext), "TimeSender is %s after restart (@)", Mem.TimeSender ? "ON" : "OFF");
        } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault Q. ****");
      break;

    case 'R':                                                                                 // Reset to default settings
      if(InputString.equals("RRRRR"))                                                         // Delete WIFI settings and set defaults
      {
        Reset();
        ResetCredentials();
        shouldReboot = true; // ESP.restart();
        break;
      }
      if(InputString.equals("RRR"))                                                           // Delete WIFI settings only
       { 
        ResetCredentials();
        snprintf(sptext, sizeof(sptext), "\nSSID and password deleted. \nWIFI, NTP and BLE is On\n Enter @ to restart");
        break;
       }
      if(len == 1)                                                                            // Set to default settings
        {
        Reset();
        snprintf(sptext, sizeof(sptext), "\nReset to default values: Done");                                                                  // Force a minute update
        Displaytime(); Tekstprintln("");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault R. ****");
      break;
      
    case 'S':                                                                                 // Slope factor for brightness
      if(len > 1 && len < 5) 
       {
        Mem.LightReducer = (byte)SConstrainInt(InputString, 1, 1, 255);
        snprintf(sptext, sizeof(sptext), "Slope brightness changed to: %d%%", Mem.LightReducer);
       } 
      else snprintf(sptext, sizeof(sptext), "**** Input fault. \nEnter Snnn where n between 1 and 255");
      break;
      
    case 'T':                                                                                 // Time setting
      if(len == 7) 
       {
        timeinfo.tm_hour = (int)SConstrainInt(InputString, 1, 3, 0, 23);
        timeinfo.tm_min  = (int)SConstrainInt(InputString, 3, 5, 0, 59);
        timeinfo.tm_sec  = (int)SConstrainInt(InputString, 5, 7, 0, 59);
        SetRTCTime();                                                                         // Always sync ESP32 internal RTC
        if(DS3231Installed)
         {
          SetDS3231Time();                                                                    // Write time to DS3231
          Mem.UseDS3231 = 1;                                                                 // Time source = DS3231
          Mem.NTPOn     = 0;                                                                 // NTP not needed
          Mem.WIFIOn    = 0;                                                                 // WIFI not needed
          StoreStructInFlashMemory();                                                        // Persist settings
          snprintf(sptext, sizeof(sptext), "Time set. DS3231=On, WIFI=Off, NTP=Off");
         }
        else
         {
          Mem.UseDS3231 = 0;
          snprintf(sptext, sizeof(sptext), "Time set (no DS3231). WIFI/NTP unchanged.");
         }
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter Thhmmss ****");
      break;

