ednieuw/ESP32Communications/Old/ESP32Arduino_CommV029/ESP32Arduino_CommV029.ino
//--------------------------------------------
class TSServerCallbacks : public NimBLEServerCallbacks
{
void onConnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo) override
  {
   TSClientConnected = true;
   TSconnHandle      = connInfo.getConnHandle();
   TSsendDelayms     = millis() - 10001;                                                       // Trigger first send immediately after delay
   TSdatePending     = false;
   Tekstprintln("TimeSender client connected");
  }
 void onDisconnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo, int reason) override
   {
    TSClientConnected  = false;
    TSClientSubscribed = false;
    TSconnHandle = 0;
    Tekstprintln("TimeSender client disconnected");
    NimBLEDevice::startAdvertising();
   }
};
//--------------------------------------------                                                //
// TIMESENDER Time Sender Start
//--------------------------------------------
void BLETimeSenderStart(void)
{
  if(TimeSenderServerRunning) return;                          
  NimBLEDevice::init(TIMESENDER_DEVICE_NAME);            
  TSpServer = NimBLEDevice::createServer();              
  TSpServer->setCallbacks(new TSServerCallbacks());      
  TSpService = TSpServer->createService(UART_SERVICE_UUID);                                  // 
  TSpTX = TSpService->createCharacteristic(UART_CHARACTERISTIC_TX, NIMBLE_PROPERTY::NOTIFY);
  TSpTX->setCallbacks(new TSCharCallbacks());                                                  // Track when client subscribes to notifications              
  TSpRX = TSpService->createCharacteristic(UART_CHARACTERISTIC_RX, NIMBLE_PROPERTY::WRITE);                                                                          
  TSpAdvertising = NimBLEDevice::getAdvertising();       
  TSpAdvertising->addServiceUUID(UART_SERVICE_UUID);     
  TSpAdvertising->start();
  TimeSenderServerRunning = true;                                                                   // 
}
//--------------------------------------------                                                //
// TIMESENDER Time Sender Stop
//--------------------------------------------
void BLETimeSenderStop(void)
{
 if(!TimeSenderServerRunning) return;                                                               // 
 if(TSpAdvertising) TSpAdvertising->stop();               
 if(TSpServer && TSClientConnected) { TSpServer->disconnect(TSconnHandle);  }
 NimBLEDevice::deinit(true);                              
 TimeSenderServerRunning = false;                               
 TSClientConnected = false;                               
 TSconnHandle      = 0;                                   
}
//--------------------------------------------                                                //
// TIMESENDER Time Sender Send Time and Date
//--------------------------------------------
void CheckTimeSender(void)
{
 if(!TimeSenderServerRunning) return;
 if(!TSClientConnected) return;
 if(!TSClientSubscribed) return;                                                               // Wait until client has subscribed to notifications (CCCD enabled)
 GetTijd(false);
 int h  = timeinfo.tm_hour;
 int m  = timeinfo.tm_min;
 int s  = timeinfo.tm_sec;
 int d  = timeinfo.tm_mday;
 int mo = timeinfo.tm_mon + 1;
 int y  = timeinfo.tm_year + 1900;

 bool sendNow = (millis() - TSsendDelayms >= 10000);

 if(sendNow)
   {
    char buffer[16];
    snprintf(buffer, sizeof(buffer),"T%02d%02d%02d", h, m, s);
    Tekstprintlnf("Sending TIME: %s", buffer);
    TSpTX->setValue((uint8_t*)buffer, strlen(buffer));   
    TSpTX->notify();
    TSsendDelayms = millis();
    TSdatePending = true;                                
   }

 if(TSdatePending && (millis() - TSsendDelayms > 1000))
   {
    char buffer[20];
    snprintf(buffer, sizeof(buffer), "D%02d%02d%04d", d, mo, (uint16_t)y);
    Tekstprintlnf("Sending DATE: D%02d%02d%04d", d, mo, y);
    TSpTX->setValue((uint8_t*)buffer, strlen(buffer));   
    TSpTX->notify();
    TSdatePending = false;                               
   }
}

//--------------------------------------------                                                //
// HC12 Initialyse HC12 serial connection
//--------------------------------------------
void InitHC12(void) 
{
  Serial1.begin(9600, SERIAL_8N1, -1, HC12_TX);                                               // -1 = no RX
}
//--------------------------------------------                                                //
// HC12 Send time via HC-12 half-duplex wireless serial communication module
//--------------------------------------------
void SendHC12TimeString(void) 
{
  char TimeStr[20];
  sprintf(TimeStr, "T%02d%02d%02d\n", timeinfo.tm_hour, timeinfo.tm_min, timeinfo.tm_sec);
  Serial1.print(TimeStr);
  Tekstprintf("HC-12 time sent: %s",TimeStr); 
}

/**************************************************************************************************/